Revit 2026 API

# FailuresAccessorCanRollBackPendingTransaction Method

---

Checks if pending failure processing can be finished by rolling back a pending transaction.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool CanRollBackPendingTransaction()
```
```vb
Public Function CanRollBackPendingTransaction As Boolean
```
```cpp
public:
bool CanRollBackPendingTransaction()
```
```fsharp
member CanRollBackPendingTransaction : unit -> bool
```

#### Return Value

Boolean True if there is a pending transaction and this transaction is allowed to be rolled back

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This FailuresAccessor is inactive (is used outside of failures processing). |

Check makes sense only if the failure processing is pending.

#### Reference

FailuresAccessor Class

Autodesk.Revit.DB Namespace